emacs-config.org
*** =krisb-prose.el=

#+begin_src emacs-lisp :tangle "modules/krisb-prose.el"
  ;;; Olivetti
  (use-package olivetti
    :hook ((org-mode Info-mode emacs-news-view-mode org-msg-edit-mode) . olivetti-mode)
    :custom
    (olivetti-lighter nil)
    (olivetti-body-width 0.6)
    (olivetti-minimum-body-width 80)
    (olivetti-margin-width 8)
    (olivetti-style 'fancy)              ; Fancy makes the buffer look like a page
    ;; FIXME 2024-01-11: This is a temporary solution. Olivetti's changing of
    ;; margins and fringes messes with the calculation of
    ;; `mode--line-format-right-align', which determines where the right side of
    ;; the mode line is placed.
    (mode-line-format-right-align
     '(:eval (if (and (bound-and-true-p olivetti-mode)
                      olivetti-style)     ; 'fringes or 'fancy
                 (let ((mode-line-right-align-edge 'right-fringe))
                   (mode--line-format-right-align))
               (mode--line-format-right-align))))
    :config
    (defun kb/olivetti--setup-faces (&optional _theme)
      "Set custom colors for `olivetti'."
      (when (fboundp 'modus-themes-with-colors)
        (set-face-attribute 'olivetti-fringe nil
                            :background (modus-themes-with-colors bg-dim)
                            :inherit 'unspecified)))
    (add-hook 'enable-theme-functions #'kb/olivetti--setup-faces))

  ;;; Astute.el
  (use-package astute
    :hook (org-mode . astute-mode)
    :custom
    (astute-lighter "")
    (astute-prefix-single-quote-exceptions
     '("bout"
       "em"
       "n'"
       "cause"
       "round"
       "twas"
       "tis")))

  ;;; Provide
  (provide 'krisb-prose)
#+end_src

*** =krisb-org.el=

#+begin_src emacs-lisp :tangle "modules/krisb-org.el"
  ;;; Built-in
  ;;;; Org
  (use-package org
    :hook ((org-mode . variable-pitch-mode)
           (org-mode . visual-line-mode)
           (org-mode . (lambda () (setq-local line-spacing 0.2 fill-column 120))))
    :bind (("C-M-s-s" . org-store-link)
           :map krisb-note-keymap
           ("c" . org-capture))
    :custom
    (org-directory krisb-org-directory)

    ;; Headline appearance
    (org-hide-leading-stars nil)
    (org-n-level-faces 8)
    (org-cycle-separator-lines 2)
    (org-cycle-level-faces t)
    (org-ellipsis " ⮷")
    (org-startup-folded 'nofold)
    (org-tags-column 0)

    ;; Markup appearance
    (org-hide-emphasis-markers t)     ; Remove org-mode markup characters
    (org-hide-macro-markers nil)
    (org-pretty-entities t)           ; Show as UTF-8 characters (useful for math)
    (org-pretty-entities-include-sub-superscripts t) ; Show superscripts and subscripts? Also see `org-export-with-sub-superscripts'
    (org-use-sub-superscripts '{}) ; Requires brackets to recognize superscripts and subscripts
    (org-hidden-keywords nil)

    ;; Movement
    (org-special-ctrl-a/e t)
    (org-ctrl-k-protect-subtree 'error)

    ;; Plain lists
    (org-list-allow-alphabetical t)
    (org-list-use-circular-motion t)

    ;; Headline insertion
    (org-blank-before-new-entry
     '((heading . auto)
       ;; Don't let Emacs make decisions about where to insert newlines
       (plain-list-item . nil)))
    (org-insert-heading-respect-content nil) ; Let M-RET make heading in place
    (org-M-RET-may-split-line '((table . nil)
                                (default . t)))

    ;; Blocks
    (org-structure-template-alist
     '(("s" . "src")
       ("e" . "src emacs-lisp")
       ("E" . "src emacs-lisp :results value code :lexical t")
       ("t" . "src emacs-lisp :tangle FILENAME")
       ("T" . "src emacs-lisp :tangle FILENAME :mkdirp yes")
       ("x" . "example")
       ("X" . "export")
       ("v" . "verse")
       ("c" . "comment")
       ("q" . "quote")))

    ;; Other
    (org-file-apps
     '((directory . emacs)
       ("\\.mm\\'" . default)
       ("\\.x?html?\\'" . default)
       ("\\.pdf\\'" . default)
       ("\\.docx\\'" . system)
       ("\\.odt\\'" . system)
       ;; Default to `auto-mode-alist'
       (auto-mode . emacs)))
    (org-fold-catch-invisible-edits 'show-and-error)
    (org-edit-timestamp-down-means-later t)
    :custom-face
    (org-quote ((t (:family ,(face-attribute 'variable-pitch :family) :extend t :inherit 'org-block))))
    (org-ellipsis ((t (:box unspecified :inherit default)))) ; Don't make line taller because of org-ellipsis
    :config
    ;; Make org-open-at-point follow file links in the same window
    (setf (cdr (assoc 'file org-link-frame-setup)) 'find-file)

    ;; Pulsar pulses
    (with-eval-after-load 'pulsar
      (dolist (hook '(org-agenda-after-show-hook org-follow-link-hook))
        (add-hook hook #'pulsar-recenter-center)
        (add-hook hook #'pulsar-reveal-entry))))

  ;;;; Org-faces
  (use-package org-faces
    :ensure nil
    :custom
    (org-fontify-todo-headline nil)
    (org-fontify-done-headline nil)
    (org-fontify-whole-block-delimiter-line nil)
    (org-fontify-quote-and-verse-blocks t))

  ;;;; Org-src
  (use-package org-src
    :ensure nil
    :custom
    (org-src-fontify-natively t)
    (org-src-window-setup 'current-window)
    (org-src-block-faces nil) ; Open src block window on current buffer were in the language's major mode
    (org-edit-src-turn-on-auto-save nil)
    (org-edit-src-auto-save-idle-delay 3))


  ;;;; Org-id
  (use-package org-id
    :ensure nil
    :custom
    (org-clone-delete-id t)
    (org-id-method 'ts)
    (org-id-link-to-org-use-id 'use-existing))

  ;;;; Org-attach
  (use-package org-attach
    :ensure nil
    :custom
    (org-attach-preferred-new-method 'id) ; Necessary to add the ATTACH tag
    (org-attach-auto-tag "ATTACH")
    (org-attach-dir-relative nil)         ; Use relative file paths?
    (org-attach-id-dir (expand-file-name "resources" org-directory))
    (org-attach-method 'cp)            ; Attach copies of files
    (org-attach-archive-delete 'query) ; If subtree is deleted or archived, ask user
    (org-attach-id-to-path-function-list
     '(org-attach-id-ts-folder-format
       org-attach-id-uuid-folder-format
       org-attach-id-fallback-folder-format)))

  ;;;; Org-footnote
  (use-package org-footnote
    :ensure nil
    :after org
    :custom
    (org-footnote-section nil)            ; Don't create footnote headline
    (org-footnote-auto-adjust t)
    (org-footnote-define-inline nil))

  ;;;; Org-babel
  (use-package ob
    :ensure nil
    :custom
    (org-babel-load-languages '((python . t)
                                (emacs-lisp . t)))
    (org-confirm-babel-evaluate nil))

  ;;;; Org-num
  (use-package org-num
    :ensure nil
    :diminish
    :bind ( :map krisb-toggle-keymap
            ("n" . org-num-mode))
    :custom
    (org-num-face 'fixed-pitch)
    (org-num-skip-commented t)
    (org-num-skip-footnotes t)
    (org-num-skip-unnumbered t))

  ;;; Org-modern
  (use-package org-modern
    :hook ((org-mode . org-modern-mode)
           (org-agenda-finalize . org-modern-agenda))
    :custom
    (org-modern-keyword nil)

    (org-modern-hide-stars "· ") ; Is affected by the value of `org-hide-leading-stars'
    (org-modern-star 'fold)
    (org-modern-fold-stars
     '(("▶" . "▼")
       ("▷" . "▽")
       ("⯈" . "⯆")
       ("▹" . "▿")
       ("▸" . "▾")))

    (org-modern-todo t) ; NOTE 2024-10-10: I set `org-modern-todo-faces' in my org-agenda section
    (org-modern-priority t)
    ;; See my value for `org-priority-faces'
    (org-modern-priority-faces
     '((?A :inverse-video t :inherit (bold org-priority))
       (?B :inverse-video t :inherit (bold org-priority))
       (?C :inverse-video t :inherit org-priority)
       (?D :inverse-video t :inherit org-priority)
       (?E :inverse-video t :inherit (shadow org-priority))
       (?F :inverse-video t :inherit (shadow org-priority))))
    ;; See my value for `org-todo-keyword-faces'
    (org-modern-todo-faces
     '(("NEXT" :inherit (bold success org-modern-todo))
       ("TODO" :inherit (org-todo org-modern-todo))
       ("HOLD" :inherit (shadow error org-modern-todo))
       ("MAYBE" :inherit (shadow org-todo org-modern-todo))
       ("DONE" :inherit (bold org-done org-modern-todo))
       ("CANCELED" :inherit (error org-modern-todo))))

    (org-modern-label-border 3)
    (org-modern-tag t)

    (org-modern-block-fringe nil) ; Doesn't work well with `olivetti-style' set to 'fancy
    (org-modern-block-name '("⌜" . "⌞"))

    (org-modern-footnote '(nil (raise 0.15) (height 0.9)))
    (org-modern-list '((?+ . "◦")
                       (?- . "–")
                       (?* . "•")))
    (org-modern-timestamp t)

    (org-modern-table t)
    (org-modern-table-vertical 3)
    (org-modern-table-horizontal 0.1)
    :custom-face
    (org-modern-label
     ((t :height 0.9 :width condensed :weight regular :underline nil)))
    (org-modern-todo ((t :weight semibold :inverse-video t :inherit org-modern-label)))
    :config
    (defun krisb-modus-themes--setup-org-modern (theme)
      "Set up org-modern faces."
      (when (string-match "^modus-" (symbol-name theme))
        ;; See my value for `org-tag-faces'
        (setopt org-modern-tag-faces
                `(("project"
                   :foreground ,(face-background 'default nil t)
                   :background ,(face-foreground 'modus-themes-fg-magenta-cooler nil t))))))
    (add-hook 'enable-theme-functions #'krisb-modus-themes--setup-org-modern))

  ;;; Org-appear
  ;; Show hidden characters (e.g. emphasis markers, link brackets) when point is
  ;; over enclosed content
  (use-package org-appear
    :hook (org-mode . org-appear-mode)
    :custom
    (org-appear-delay 0.0)
    (org-appear-trigger 'always)
    (org-appear-autoemphasis t)
    (org-appear-autolinks 'just-brackets)
    (org-appear-autosubmarkers t)
    (org-appear-autoentities t)
    (org-appear-autokeywords t)
    (org-appear-inside-latex t))

  ;;; Provide
  (provide 'krisb-org)
#+end_src

** Blogging

*** =krisb-mermaid.el=

#+begin_src emacs-lisp :tangle "modules/krisb-mermaid.el"
  ;;; Mermaid-mode
  (use-package mermaid-mode)

  ;;; Ob-mermaid
  ;; Mermaid diagrams
  (use-package ob-mermaid
    :ensure-system-package (mmdc . mermaid-cli)
    :custom
    (ob-mermaid-cli-path (executable-find "mmdc"))
    :config
    (org-babel-do-load-languages 'org-babel-load-languages
                                 (append '((mermaid . t)) org-babel-load-languages)))

  ;;; Provide
  (provide 'krisb-mermaid)
#+end_src

* Lisp (libraries)
:PROPERTIES:
:VISIBILITY: children
:END:

