emacs-config.org
** =krisb-common.el=

#+begin_src emacs-lisp :tangle "lisp/krisb-common.el"
  ;;; krisb-common.el --- Common variables and functions  -*- lexical-binding: t; -*-

  ;; Copyright (C) 2024  Kristoffer Balintona

  ;; Author: Kristoffer Balintona <krisbalintona@gmail.com>
  ;; Keywords: lisp

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; Variables and functions I use throughout my Emacs config.

  ;;; Code:

  ;;; Variables

  ;;;; Me
  (setq user-full-name "Kristoffer Balintona"
        user-mail-address "krisbalintona@gmail.com")

  ;;;; System
  (defconst krisb-system-win-p
    (eq system-type 'windows-nt)
    "Are we running on a WinTel system?")

  (defconst krisb-system-mac-p
    (eq system-type 'darwin)
    "Are we running on a Mac system?")

  (defconst krisb-system-linux-p
    (eq system-type 'gnu/linux)
    "Are we running on a GNU/Linux system?")

  (defconst krisb-linux-distribution
    (when krisb-system-linux-p (shell-command-to-string "printf %s \"$(lsb_release -sd)\""))
    "An escaped string that has the name of my Linux distribution.")

  (defconst krisb-linux-ubuntu-p
    (integerp (string-match "Ubuntu" krisb-linux-distribution))
    "Is this Ubuntu?")

  (defconst krisb-linux-fedora-p
    (integerp (string-match "Fedora" krisb-linux-distribution))
    "Is this Fedora?")

  (defconst krisb-linux-arch-p
    (integerp (string-match "Arch" krisb-linux-distribution))
    "Is this Arch Linux?")

  ;;;; Org
  (defvar krisb-org-directory (expand-file-name "org-database" "~/Documents")
    "The directory holding my org files.
  Meant to be used as the value of `org-directory'.")

  (defvar krisb-notes-directory (expand-file-name "notes" krisb-org-directory)
    "My notes directory.")

  (defvar krisb-blog-directory (expand-file-name "blog" krisb-notes-directory)
    "The directory for my pre-export blog files.")

  (defvar krisb-org-agenda-directory (expand-file-name "agenda" krisb-org-directory)
    "The directory holding my main org-agenda files.")

  (defvar krisb-org-agenda-main-file (expand-file-name "todo.org" krisb-org-agenda-directory)
    "My main org-agenda file.")

  (defvar krisb-org-agenda-directory-files (cl-remove-if
                                            (lambda (f)
                                              (string-match-p (rx "archive.org") f))
                                            (directory-files-recursively krisb-org-agenda-directory ".org$"))
    "A list of all org and org_archive files in `krisb-org-directory'.")

  (defvar krisb-bibliography-files (list (expand-file-name "master-lib.bib" krisb-org-directory))
    "A list of my bibliography (.bib) files.")

  ;;; Functions

  ;;; Macros

  ;;; Commands

  ;;; Keymaps
  (defvar-keymap krisb-note-keymap
    :doc "Prefix for my note-taking needs.")
  (bind-key "C-c n" krisb-note-keymap 'global-map)

  (defvar-keymap krisb-lsp-keymap
    :doc "Prefix for lsp-related commands.")
  (with-eval-after-load 'lsp-mode
    (bind-key "C-c l" krisb-lsp-keymap 'lsp-mode-map))

  (defvar-keymap krisb-file-keymap
    :doc "Prefix for file-related commands.")
  (bind-key "C-c f" krisb-file-keymap 'global-map)

  (defvar-keymap krisb-yank-keymap
    :doc "Prefix for yanking stuff.")
  (bind-key "C-c i" krisb-yank-keymap 'global-map)

  (defvar-keymap krisb-open-keymap
    :doc "Prefix for opening various hings.")
  (bind-key "C-c o" krisb-open-keymap 'global-map)

  (defvar-keymap krisb-toggle-keymap
    :doc "Prefix for toggling stuff.")
  (bind-key "C-M-s-t" krisb-toggle-keymap 'global-map)


  ;;; Provide
  (provide 'krisb-common)
  ;;; krisb-common.el ends here
#+end_src

** =krisb-vertico.el=

#+begin_src emacs-lisp :tangle "lisp/krisb-vertico.el"
  ;;; krisb-vertico.el --- Vertico extensions          -*- lexical-binding: t; -*-

  ;; Copyright (C) 2024  Kristoffer Balintona

  ;; Author: Kristoffer Balintona <krisbalintona@gmail.com>
  ;; Keywords: lisp

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; Extension to Vertico.

  ;;; Code:
  (require 'vertico)

  ;;; Tab for tramp paths
  ;; Exception for TAB behavior when completing TRAMP paths. See
  ;; https://github.com/minad/vertico/wiki#restore-old-tab-behavior-when-completing-tramp-paths
  (defun krisb-vertico-insert-unless-tramp ()
    "Insert current candidate in minibuffer, except for tramp."
    (interactive)
    (if (vertico--remote-p (vertico--candidate))
        (minibuffer-complete)
      (vertico-insert)))
  (bind-key [remap vertico-insert] #'krisb-vertico-insert-unless-tramp 'vertico-map)

  ;;; Exceptions for org commands
  ;; Special for `org-agenda-filter' and `org-tags-view'. See
  ;; https://github.com/minad/vertico?tab=readme-ov-file#org-agenda-filter-and-org-tags-view
  (defun krisb-vertico-org-enforce-basic-completion (&rest args)
    (minibuffer-with-setup-hook
        (:append
         (lambda ()
           (let ((map (make-sparse-keymap)))
             (define-key map [tab] #'minibuffer-complete)
             (use-local-map (make-composed-keymap (list map) (current-local-map))))
           (setq-local completion-styles (cons 'basic completion-styles)
                       vertico-preselect 'prompt)))
      (apply args)))
  (with-eval-after-load 'org
    (declare-function org-make-tags-matcher "org")
    (advice-add #'org-make-tags-matcher :around #'krisb-vertico-org-enforce-basic-completion))
  (with-eval-after-load 'org-agenda
    (declare-function org-agenda-filter "org-agenda")
    (advice-add #'org-agenda-filter :around #'krisb-vertico-org-enforce-basic-completion))

  ;;; Truncate long filenames
  ;; Left-truncate filename candidates. Taken from
  ;; https://github.com/minad/vertico/wiki#left-truncate-recentf-filename-candidates-eg-for-consult-buffer
  (defun krisb-vertico-truncate-filename-candidates (args)
    (if-let ((arg (car args))
             (type (get-text-property 0 'multi-category arg))
             ((eq (car-safe type) 'file))
             (w (max 30 (- (window-width) 38)))
             (l (length arg))
             ((> l w)))
        (setcar args (concat "…" (truncate-string-to-width arg l (- l w)))))
    args)
  (advice-add #'vertico--format-candidate :filter-args #'krisb-vertico-truncate-filename-candidates)

  ;;; Provide
  (provide 'krisb-vertico)
  ;;; krisb-vertico.el ends here
#+end_src

* COMMENT Removed
:PROPERTIES:
:VISIBILITY: folded
:END:

These are lines I've removed while porting to a literate config.
#+begin_src emacs-lisp :tangle no :results none
  ;; Kill child processes without confirm
  (custom-set-variables '(confirm-kill-processes nil))

  ;; Don't confirm when killing a process
  (setq confirm-kill-processes nil)

  ;; ...And the clipboard on Windows is often a wider encoding (UTF-16), so leave
  ;; Emacs to its own devices there.
  (unless krisb-system-win-p
    (setq selection-coding-system 'utf-8))
#+end_src

* Local variables :noexport:
:PROPERTIES:
:VISIBILITY: folded
:END:

# Local Variables:
# org-src-fontify-natively: nil
# End:

#  LocalWords:  Vertico Minibuffer
